app/controllers/pages_controller.rb

SELECT "users".* FROM "users" ORDER BY "users"."name" ASC
---
  def dashboard
    @users = User.order(:name)