app/controllers/posts_controller.rb

  def create
    @post = Post.new(post_params)
    @post.user = current_user

    respond_to do |format|
      if @post.save
---
INSERT INTO "posts" ("title", "content", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "Post 1"], ["content", "fjg"], ["user_id", 1], ["created_at", "2018-09-11 04:13:38.444901"], ["updated_at", "2018-09-11 04:13:38.444901"]]