app/controllers/user_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 12], ["LIMIT", 1]]
UPDATE "users" SET "updated_at" = $1, "role" = $2 WHERE "users"."id" = $3  [["updated_at", "2018-09-12 00:20:05.679784"], ["role", 1], ["id", 12]]
---
  def update
    @user = User.find(params[:id])
    @user.role = params[:role]
    if @user.save